proyecto_final/src/performance/test_cluster.txt
Running scenarios...
Phase started: unnamed (index: 0, duration: 1s) 16:57:03(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 16:57:04(-0300)

--------------------------------------
Metrics for period to: 16:57:10(-0300) (width: 6.342s)
--------------------------------------

http.codes.200: ................................................................ 216
http.request_rate: ............................................................. 36/sec
http.requests: ................................................................. 227
http.response_time:
  min: ......................................................................... 43
  max: ......................................................................... 1918
  median: ...................................................................... 135.7
  p95: ......................................................................... 871.5
  p99: ......................................................................... 1064.4
http.responses: ................................................................ 216
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20


--------------------------------------
Metrics for period to: 16:57:20(-0300) (width: 9.218s)
--------------------------------------

http.codes.200: ................................................................ 327
http.request_rate: ............................................................. 36/sec
http.requests: ................................................................. 330
http.response_time:
  min: ......................................................................... 80
  max: ......................................................................... 1082
  median: ...................................................................... 106.7
  p95: ......................................................................... 871.5
  p99: ......................................................................... 907
http.responses: ................................................................ 327


All VUs finished. Total time: 35 seconds

--------------------------------
Summary report @ 16:57:36(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 18/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 43
  max: ......................................................................... 1918
  median: ...................................................................... 106.7
  p95: ......................................................................... 871.5
  p99: ......................................................................... 1043.3
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 28146.9
  max: ......................................................................... 30225.9
  median: ...................................................................... 29445.4
  p95: ......................................................................... 30040.3
  p99: ......................................................................... 30040.3